{"article":[
     {
          "id":1,
          "title":"Introduction",
          "subtitle":"Welcome to my personal website. A showcase of opinions and technologies",
          "teaser":"Just a fair warning, i'm not exactly a professioned writter, so alot that I end up writting will seem very mundane if not sporadic, but at the same time i do hope to be able to use this as a platform of being able to share differents types of contextual information...",
          "full":"<image1></image1><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'>To all my readers, welcome to my new personal website, aka the platform I will be using to not only showcase my projects but also to voice my opinions and sometimes address conceptual information related to Computer Science from the easier to understand prospect. Gatsby and Netlfy have been of great help for me when it came to deploying an aesthetic website with semi-dynamic features.</p> <h5>Why did I choose Gatsby?</h5><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'>As someone experienced in working on large scale web apps using Node.js and React, The choice of using Gatsby was an easy one. As stated by Gatsby, it is a free and open source framework based on React, that uses Graphql as the bases of handling data, that allows it to act dynamic but within limitations. By doing so the website can have app-like functionalities deployed on platforms such as Netlify and GitHub, with little to no cost, and after all as a fresh college graduate, I need to make budget cuts wherever I can, or else I would be eating cup noodles all year long. In other words, Gatsby seemed to be the sweet spot between a static and a fully dynamic website, allowing me more functionality but saving me from the cost of deployment.</p><h5>Features and Workflow.</h5><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'>For now the site is made in very vanilla terms with flavors being added on incrementally. The workflow of the site starts off with:</p><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'><ul style='list-style-type:disc;'> <li>Setting up a work folder and declaring it as a new gatsby project.</li> <li>Linking the folder with a git repository on GitHub, through GitKraken.</li> <li>Adding bootstrap 4.0 to the gatsby project to aid with implementation of grids and cards.</li> <li>Adding `gatsby-transformer-json` to parse raw JSON strings into JavaScript objects.</li> <li>Setting up modules for navigation bar, side bar, article card and article pages, allowing for each module to access data using Graphql, to dynamically show its content.</li> <li>Setting up javascript functions that reads the string in the acquired JavaScript Object separating the article attribute and interpreting a mixture of text and html strings transforming them into html tags with its relevant paragraphs and images.</li> <li>Using Netlify to deploy the website after pushing changes to Github.</li></ul><br>This is just a shallow outline of how the website runs under the hood, in the future I might go further into the javascript functions and how they work to make the website feel like a pseudo-dynamic web app.</p><h5>Plans for the future?</h5><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'>future is open-ended and in this case, open sourced as well. For immediate future, I'll be using the website as a platform to blog about topics I feel I have an opinion to voice, and hence It would only be fair if I allow for comments to be added to articles as well for feedback. The current javascript function used to convert JSON objects to HTML tags is convoluted, and I believe it could be simplified, and that might require me to make a script from the ground up rather than using the API’s I am using right now that require somewhat of a hacky solution. Another use in the back of my mind is to use cloud functions and hooks for running local scripts for other projects I might have in the future, but you can say that idea is still `up in the clouds`.</p><h5>Long Story Short!</h5><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'>Well nothing really, just a warm welcome to anyone that happens to stumble upon this website. Hopefully I can work better upon this website and introduce new ideas that really push the limits of Gatsby and Netlify.</p>",
          "img":["https://github.com/bangoga/bangoga.github.io/blob/master/fie.jpg?raw=true",
               "https://cdn.pixabay.com/photo/2018/01/14/23/12/nature-3082832_960_720.jpg",          
               "https://thumbs-prod.si-cdn.com/N-_fU5xNOvR2T25teuPAdtGkBhY=/800x600/filters:no_upscale()/https://public-media.si-cdn.com/filer/90/b2/90b2dfe5-a9ab-4821-9ccc-45ae1d52fa8a/blackholewithclouds_c-1-941x519.jpg"
          ]
     },
     {
          "id":2,
          "title":"Mental Health Manic",
          "subtitle":"Opinion on the sensationalization and captilization of mental health",
          "teaser":"This is going to be a long one, and maybe not even appreciated by a lot of people but here it goes. I’ve had quite some time to think about this topic. The idea of getting mental health help is being promoted crazy recently.  With most university pushing the envelope trying to get students to normalize getting mental health services to celebrities and youtube sensations advocating for getting help over apps like BetterHelp",
          "full":"<image1></image1><p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'> This is going to be a long one, and maybe not even appreciated by a lot of people but here it goes. <br></br> I’ve had quite some time to think about this topic. The idea of getting mental health help is being promoted crazy recently. With most university pushing the envelope trying to get students to normalize getting mental health services to celebrities and youtube sensations advocating for getting help over apps like BetterHelp. Now before i go on saying anything more, i’d like to point out that I’m not against getting help, my concerns are not over the idea of mental health services but the state of mental health services themselves. <br></br> For anyone who’s been through the system of getting counseling or care, the imagery of sitting in front of another human being and being expected to spill out the narrative that has defined you is pretty vivid. It's a daunting task to expose yourself and be so vulnerable in front of a complete stranger and the fact that they don’t exactly reciprocate that vulnerability doesn’t make it any better. But hey we are encouraged to pay that 150$ per session in return of the hope that maybe just talking about what is bothering us will also ‘fix’ us, but that's not the case. Many a times these counseling sessions will fall short of what we’d expect which pretty much boils down to the way counsellors are trained. Depersonalized, that's the keyword for most therapist, keep the sessions depersonalized, and guide them through objective reasoning. The idea of making sure that clients don’t see you as a friend is very important but at the same time that kind of makes all this a balancing beam where you have to be empathic but also subjective? Personally I believe in the process of being subjective, you can lose a bit of your humanity. We are all human, sensitive to the both micro and macro expressions of individuals, which in turn keeps us connected to others and sane, but being too subjective, could lead to be seen as objects of study and as a result just doesn’t build that connection; this gets even worse when apps like betterhelp builds a layer of abstraction between the individuals. What happens then? Well you spend that 150$ to bounce between one therapist to another till you find one you can connect with? I just find that insane, especially considering a lot of the clients they’d have just need someone to talk to and feel human with, but instead end up getting the complete opposite. <br></br></p> <image2></image2> <p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'> Another issue I have is with the insane amount of labelling that just goes around with mental health services. Every other kid is labelled as ADHD, every other person is labelled as anxious, and sometimes mislabelled as depressive as well. Note, I’m not saying there aren’t people who are what they have been labelled as, i’m saying that it's easy to just label a person as one marker in the list of mental disorder and tell them hey look there are others like you too. What sometimes isn’t discussed is that everyone feels depressed at some points in their life and everyone is anxious about something. Its called being human, and that's the only label that's needed, and the only thing needed from therapist is understanding the underlying reasons for their unresolved feelings. As unpopular of an opinion as it might be, I’m against labelling kids, they need to be supported and helped first; with labels comes to obsession of pushing for taking pills or the scare of the label becoming part of one's identity. We are more that the wounds of our past and the weaknesses shown in crisis. <br></br></p> <image3></image3> <p style='font-size:16px;line-height:1.58;letter-spacing:-.003em;font-weight:400'> So what am i even trying to say then? That mental health care is bad? No. Mental health care should always be sought when needed but alot of our problems stem from the lack of humanity we tend to show each other in our daily lives. We are all human, going through our own stories with our struggles. Take time to know these stories, take time to show compassion, take time to be human. Reach for your friendships and relationships with a sense of curiosity but also humanity. Sometimes a mutual vulnerability proves to be more therapy than 150$ session once every two weeks. <br></br> TL;DR : Read the last paragraph. Here is a link that kinda inspired me to think about this, don't agree with everything he says but gives some valuable insight how therapy can sometimes be treated as any other medical care system<br></br></p>",
                "img":["https://www.thetelegram.com/media/photologue/photos/cache/TG-Mental_Health_large.jpg",
               "https://www.amsa.org/wp-content/uploads/2018/08/betterhelp-page.jpg",          
               "http://www.warecoveryhelpline.org/wp-content/uploads/2018/05/About-Us.jpg"
          ]
     },
     {
          "id":3,
          "title":"Man City and Man Utd willing to pay £65m for Harry Maguire" ,
          "subtitle":"",
          "teaser":"Manchester City and Manchester United have told Leicester they are prepared to pay £65m for Harry Maguire, Sky Sports News understands. Talks between both Manchester clubs and Leicester have been ongoing for several weeks but as yet a deal is no closer to being agreed. Maguire is understood to be happy at Leicester and won't attempt to force a transfer, but is open to the idea of a move to one of the Premier League's leading six sides.",
          "full":"Manchester City and Manchester United have told Leicester they are prepared to pay £65m for Harry Maguire, Sky Sports News understands. Talks between both Manchester clubs and Leicester have been ongoing for several weeks but as yet a deal is no closer to being agreed. Maguire is understood to be happy at Leicester and won't attempt to force a transfer, but is open to the idea of a move to one of the Premier League's leading six sides.",
          "img":[]
     },
     {
          "id":4,
          "title":"Cannibal Holocaust, Genius or Gore" ,
          "subtitle":"",
          "teaser":"Cannibal Holocaust is a 1980 Italian cannibal horror film directed by Ruggero Deodato and written by Gianfranco Clerici. It stars Robert Kerman as Harold Monroe, an anthropologist from New York University who leads a rescue team into the Amazon rainforest to locate a crew of filmmakers. Played by Carl Gabriel Yorke, Francesca Ciardi, Perry Pirkanen, and Luca Barbareschi, the crew had gone missing while filming a documentary on local cannibal tribes. When the rescue team is only able to recover the crew's lost cans of film",
          "full":"<div class=`text-center`> <figure class=`figure`> <img class=`mx-auto d-block` src=`https://c-8oqtgrjgwu46x24koikzx2etcpmgtx2eeqo.g00.ranker.com/g00/3_c-8yyy.tcpmgt.eqo_/c-8OQTGRJGWU46x24jvvrux3ax2fx2fkoikz.tcpmgt.eqox2fwugt_pqfg_koix2f72202x2f3223712504x2fqtkikpcnx2ffktgevqt-twiigtq-fgqfcvq-ycu-ejctigf-ykvj-owtfgt-chvgt-vjg-hkno-cpf-_51_u-tgngcug-rjqvq-w5x3fyx3d872x26sx3d72x26hox3drlrix26hkvx3detqrx26etqrx3dhcegux26k32e.octmx3dkocig_$/$/$/$/$/$` class=`img-fluid` alt=`Front page`></img> <figcaption class=`figure-caption`>A caption for the above image.</figcaption> </figure> </div> <p style={{fontSize:20,lineHeight:1.8}}><br></br>Cannibal Holocaust is a 1980 Italian cannibal horror film directed by Ruggero Deodato and written by Gianfranco Clerici. It stars Robert Kerman as Harold Monroe, an anthropologist from New York University who leads a rescue team into the Amazon rainforest to locate a crew of filmmakers. Played by Carl Gabriel Yorke, Francesca Ciardi, Perry Pirkanen, and Luca Barbareschi, the crew had gone missing while filming a documentary on local cannibal tribes. When the rescue team is only able to recover the crew's lost cans of film, an American television station wishes to broadcast the footage as a sensationalized television special. Upon viewing the reels, Monroe is appalled by the team's actions and objects to the station's intent to air the documentary.<br></br><br></br> Influenced by the documentaries of Mondo director Gualtiero Jacopetti,[1][3] Cannibal Holocaust was inspired by Italian media coverage of Red Brigade terrorism. The coverage included news reports that Deodato believed to be staged, an idea which became an integral aspect of the film's story.[4] Approximately half of the film consists of the documentary crew's lost footage, the presentation of which innovated the found footage genre that was later popularized in American cinema by The Blair Witch Project. Noted for its realism, Cannibal Holocaust was filmed primarily on location in the Amazon rainforest of Colombia with indigenous tribes interacting with American and Italian actors.[5]<br></br><br></br> Cannibal Holocaust achieved notoriety as its graphic violence aroused a great deal of controversy. After its premiere in Italy, it was ordered to be seized by a local magistrate, and Deodato was arrested on obscenity charges. He was later charged with multiple counts of murder due to rumors that claimed several actors were killed on camera. Although Deodato was cleared of these charges, the film was banned in Italy, Australia, and several other countries due to its graphic content, including sexual assault and genuine violence toward animals. Although some nations have since revoked the ban, it is still upheld in several countries. In retrospective analyses, the film's violence has been noted as commentary on ethics in journalism, exploitation of developing countries, and the nature of modern society versus uncivilized society, although these interpretations have also been met with criticism</p>",
          "img":["https://c-8oqtgrjgwu46x24koikzx2etcpmgtx2eeqo.g00.ranker.com/g00/3_c-8yyy.tcpmgt.eqo_/c-8OQTGRJGWU46x24jvvrux3ax2fx2fkoikz.tcpmgt.eqox2fwugt_pqfg_koix2f72202x2f3223712504x2fqtkikpcnx2ffktgevqt-twiigtq-fgqfcvq-ycu-ejctigf-ykvj-owtfgt-chvgt-vjg-hkno-cpf-_51_u-tgngcug-rjqvq-w5x3fyx3d872x26sx3d72x26hox3drlrix26hkvx3detqrx26etqrx3dhcegux26k32e.octmx3dkocig_$/$/$/$/$/$"]
     }
]}

