[
    {
        "pid":"1",
        "title":"Hello everyone to my personal website. The source for details on my projects, opinions and sometimes even notes.",
        "teaser":"Just a fair warning, i'm not exactly a professioned writter, so alot that I end up writting will seem very mundane if not sporadic, but at the same time i do hope to be able to use this as a platform of being able to share differents types of contextual information...",
        "full":"The deal is worth £50m and the 21-year-old England Under-21 international is set to travel for a medical imminently before going on holiday. United have offered Wan-Bissaka a long-term contract and wages of up to £80,000 a week.He is on £10,000 a week at Selhurst Park, the lowest-paid player in Palace's first-team squad Wan-Bissaka joined Crystal Palace academy when he was 11 and made his first-team debut in 2018.",
        "img":["https://c-8oqtgrjgwu46x24koikzx2etcpmgtx2eeqo.g00.ranker.com/g00/3_c-8yyy.tcpmgt.eqo_/c-8OQTGRJGWU46x24jvvrux3ax2fx2fkoikz.tcpmgt.eqox2fwugt_pqfg_koix2f72202x2f3223712504x2fqtkikpcnx2ffktgevqt-twiigtq-fgqfcvq-ycu-ejctigf-ykvj-owtfgt-chvgt-vjg-hkno-cpf-_51_u-tgngcug-rjqvq-w5x3fyx3d872x26sx3d72x26hox3drlrix26hkvx3detqrx26etqrx3dhcegux26k32e.octmx3dkocig_$/$/$/$/$/$"]
    },
   {
        "pid":"2",
        "title":"Manchester United have reached an agreement with Crystal Palace to sign right-back Aaron Wan-Bissaka.",
        "teaser":"The deal is worth £50m and the 21-year-old England Under-21 international is set to travel for a medical imminently before going on holiday. United have offered Wan-Bissaka a long-term contract and wages of up to £80,000 a week.He is on £10,000 a week at Selhurst Park, the lowest-paid player in Palace's first-team squad Wan-Bissaka joined Crystal Palace academy when he was 11 and made his first-team debut in 2018.",
        "full":"The deal is worth £50m and the 21-year-old England Under-21 international is set to travel for a medical imminently before going on holiday. United have offered Wan-Bissaka a long-term contract and wages of up to £80,000 a week.He is on £10,000 a week at Selhurst Park, the lowest-paid player in Palace's first-team squad Wan-Bissaka joined Crystal Palace academy when he was 11 and made his first-team debut in 2018.",
        "img":[]
    },
   {
        "pid":"3",
        "title":"Man City and Man Utd willing to pay £65m for Harry Maguire" ,
        "teaser":"Manchester City and Manchester United have told Leicester they are prepared to pay £65m for Harry Maguire, Sky Sports News understands. Talks between both Manchester clubs and Leicester have been ongoing for several weeks but as yet a deal is no closer to being agreed. Maguire is understood to be happy at Leicester and won't attempt to force a transfer, but is open to the idea of a move to one of the Premier League's leading six sides.",
        "full":"Manchester City and Manchester United have told Leicester they are prepared to pay £65m for Harry Maguire, Sky Sports News understands. Talks between both Manchester clubs and Leicester have been ongoing for several weeks but as yet a deal is no closer to being agreed. Maguire is understood to be happy at Leicester and won't attempt to force a transfer, but is open to the idea of a move to one of the Premier League's leading six sides.",
        "img":[]
    },
   {
        "pid":"4",
        "title":"Cannibal Holocaust, Genius or Gore" ,
        "teaser":"Cannibal Holocaust is a 1980 Italian cannibal horror film directed by Ruggero Deodato and written by Gianfranco Clerici. It stars Robert Kerman as Harold Monroe, an anthropologist from New York University who leads a rescue team into the Amazon rainforest to locate a crew of filmmakers. Played by Carl Gabriel Yorke, Francesca Ciardi, Perry Pirkanen, and Luca Barbareschi, the crew had gone missing while filming a documentary on local cannibal tribes. When the rescue team is only able to recover the crew's lost cans of film",
        "full":"<div class=`text-center`> <figure class=`figure`> <img class=`mx-auto d-block` src=`https://c-8oqtgrjgwu46x24koikzx2etcpmgtx2eeqo.g00.ranker.com/g00/3_c-8yyy.tcpmgt.eqo_/c-8OQTGRJGWU46x24jvvrux3ax2fx2fkoikz.tcpmgt.eqox2fwugt_pqfg_koix2f72202x2f3223712504x2fqtkikpcnx2ffktgevqt-twiigtq-fgqfcvq-ycu-ejctigf-ykvj-owtfgt-chvgt-vjg-hkno-cpf-_51_u-tgngcug-rjqvq-w5x3fyx3d872x26sx3d72x26hox3drlrix26hkvx3detqrx26etqrx3dhcegux26k32e.octmx3dkocig_$/$/$/$/$/$` class=`img-fluid` alt=`Front page`></img> <figcaption class=`figure-caption`>A caption for the above image.</figcaption> </figure> </div> <p style={{fontSize:20,lineHeight:1.8}}><br></br>Cannibal Holocaust is a 1980 Italian cannibal horror film directed by Ruggero Deodato and written by Gianfranco Clerici. It stars Robert Kerman as Harold Monroe, an anthropologist from New York University who leads a rescue team into the Amazon rainforest to locate a crew of filmmakers. Played by Carl Gabriel Yorke, Francesca Ciardi, Perry Pirkanen, and Luca Barbareschi, the crew had gone missing while filming a documentary on local cannibal tribes. When the rescue team is only able to recover the crew's lost cans of film, an American television station wishes to broadcast the footage as a sensationalized television special. Upon viewing the reels, Monroe is appalled by the team's actions and objects to the station's intent to air the documentary.<br></br><br></br> Influenced by the documentaries of Mondo director Gualtiero Jacopetti,[1][3] Cannibal Holocaust was inspired by Italian media coverage of Red Brigade terrorism. The coverage included news reports that Deodato believed to be staged, an idea which became an integral aspect of the film's story.[4] Approximately half of the film consists of the documentary crew's lost footage, the presentation of which innovated the found footage genre that was later popularized in American cinema by The Blair Witch Project. Noted for its realism, Cannibal Holocaust was filmed primarily on location in the Amazon rainforest of Colombia with indigenous tribes interacting with American and Italian actors.[5]<br></br><br></br> Cannibal Holocaust achieved notoriety as its graphic violence aroused a great deal of controversy. After its premiere in Italy, it was ordered to be seized by a local magistrate, and Deodato was arrested on obscenity charges. He was later charged with multiple counts of murder due to rumors that claimed several actors were killed on camera. Although Deodato was cleared of these charges, the film was banned in Italy, Australia, and several other countries due to its graphic content, including sexual assault and genuine violence toward animals. Although some nations have since revoked the ban, it is still upheld in several countries. In retrospective analyses, the film's violence has been noted as commentary on ethics in journalism, exploitation of developing countries, and the nature of modern society versus uncivilized society, although these interpretations have also been met with criticism</p>",
        "img":["https://c-8oqtgrjgwu46x24koikzx2etcpmgtx2eeqo.g00.ranker.com/g00/3_c-8yyy.tcpmgt.eqo_/c-8OQTGRJGWU46x24jvvrux3ax2fx2fkoikz.tcpmgt.eqox2fwugt_pqfg_koix2f72202x2f3223712504x2fqtkikpcnx2ffktgevqt-twiigtq-fgqfcvq-ycu-ejctigf-ykvj-owtfgt-chvgt-vjg-hkno-cpf-_51_u-tgngcug-rjqvq-w5x3fyx3d872x26sx3d72x26hox3drlrix26hkvx3detqrx26etqrx3dhcegux26k32e.octmx3dkocig_$/$/$/$/$/$"]     
   }
]
